---
kind: property
id: P:Autodesk.Revit.DB.PlanViewRange.Unlimited
source: html/5b21cada-9846-35fa-0a1e-e661d3d916c0.htm
---
# Autodesk.Revit.DB.PlanViewRange.Unlimited Property

View range is unlimited

## Syntax (C#)
```csharp
public static ElementId Unlimited { get; }
```